meatbag-maintenance.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-26 Tue 23:17 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>meatbag maintenance</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="meatbag maintenance">
<meta property="og:description" content="">
<meta property="description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/warm.png">
<meta property="og:url" content="https://notes.neeasade.net/meatbag-maintenance.html">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='/assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='./assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='/assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='./assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>Up: arst wow</a>
</div>

<div style="float: right">
    <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2020-07-15-meatbag-maintenance.org">Last edit: <2020-11-02></a>
</div>

<p>
<h1 class=title>meatbag maintenance</h1>
</p>


<hr>

<p>
Accept that you are trapped in this bag of flesh for the current eternity. It is worth shaping your reality through this skin sack to be better. A better vehicle for the entity that is YOU = a better life and time here, as much as you can.
</p>

<div id="outline-container-h-d445764d-4713-481b-860b-cf34bcd8722a" class="outline-2">
<h2 id="h-d445764d-4713-481b-860b-cf34bcd8722a"><span class="section-number-2">1.</span> Exercise <span class=anchor><a href="#h-d445764d-4713-481b-860b-cf34bcd8722a">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-d445764d-4713-481b-860b-cf34bcd8722a">
<p>
Getting sweaty 3x 20 minutes a week can reduce your overall mortality rate significantly. The transition of your body from an untrained state into a trained one (&ldquo;noob gains&rdquo;) is a wonderful thing to experience. This is probably the #1 thing on the list, as regular exercise will increase your overall energy level and allow for a higher quality sleep.
</p>

<p>
I cannot stress this enough, regular exercise boosts your energy, mood, and overall health. You will be more content if you exercise.
</p>
</div>
</div>

<div id="outline-container-h-7935a434-4d6b-489b-bb1a-0d0c6815cd88" class="outline-2">
<h2 id="h-7935a434-4d6b-489b-bb1a-0d0c6815cd88"><span class="section-number-2">2.</span> Teeth <span class=anchor><a href="#h-7935a434-4d6b-489b-bb1a-0d0c6815cd88">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-7935a434-4d6b-489b-bb1a-0d0c6815cd88">
<p>
Healthy gums = tight gums = less room for sugars and foods to get stuck between your teeth. You can get healthy gums by flossing <b>regularly</b>. Brush your teeth and floss to remove bits that would stick around and rot your teeth.
</p>

<p>
Every time you drink {soda,coffee,tea,&lt;anything acidic&gt;}, you lower the PH level of your mouth, leaving your teeth in a weakened state until things normalize. My current mental model is to imagine a &ldquo;time-to-normal PH&rdquo; timer that resets everytime I take a sip of coffee. Thus, it&rsquo;s in my best interest to intake my coffee in a short time window, as opposed to sipping it all day.
</p>
</div>
</div>

<div id="outline-container-h-57583996-7d9e-4091-beb0-4ffc9087504a" class="outline-2">
<h2 id="h-57583996-7d9e-4091-beb0-4ffc9087504a"><span class="section-number-2">3.</span> Sleep <span class=anchor><a href="#h-57583996-7d9e-4091-beb0-4ffc9087504a">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-57583996-7d9e-4091-beb0-4ffc9087504a">
<p>
Keeping a regular sleep schedule schedule is the key here. Habit is everything, and your body will help you both fall asleep and wake up if you get this down.
</p>

<ul class="org-ul">
<li>Keep your sleep area as dark as possible
<ul class="org-ul">
<li>remove any blue light source from within your room</li>
<li>blackout curtains</li>
</ul></li>
<li>Get a box fan for white noise if you need to mask surrounding sounds</li>
<li>Don&rsquo;t use your bed for anything other than sleep or sex
<ul class="org-ul">
<li>If you lounge in bed, your brain will associate it with &ldquo;lounge time&rdquo; and you will want to be awake</li>
</ul></li>
</ul>

<p>
Other: When you are sleep deprived, your ability to gauge your sleep deprivation is degraded. Also, you cannot &ldquo;pay back&rdquo; sleep evenly &#x2013; you will simply be off (that is, you cannot make up an all-nighter all at once, you feel it&rsquo;s effects for awhile).
</p>
</div>
</div>

<div id="outline-container-h-2d5f4ffd-d0f4-4bca-82ab-5204f116e371" class="outline-2">
<h2 id="h-2d5f4ffd-d0f4-4bca-82ab-5204f116e371"><span class="section-number-2">4.</span> Diet <span class=anchor><a href="#h-2d5f4ffd-d0f4-4bca-82ab-5204f116e371">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-2d5f4ffd-d0f4-4bca-82ab-5204f116e371">
<p>
Fasting (or intermittent fasting) can be a powerful tool.
</p>

<p>
I&rsquo;m an off and on keto dieter. There&rsquo;s plenty of resources around for how that changes your body&rsquo;s relationship to insulin and fat. I will emphasize here that for weight loss purposes, the main advantage is the loss of appetite that people experience on keto, allowing them to have an easier time maintaining a caloric deficit.
</p>
</div>
</div>

<div id="outline-container-h-3dd729a7-0f82-4b68-a320-4fab18920606" class="outline-2">
<h2 id="h-3dd729a7-0f82-4b68-a320-4fab18920606"><span class="section-number-2">5.</span> Skin <span class=anchor><a href="#h-3dd729a7-0f82-4b68-a320-4fab18920606">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-3dd729a7-0f82-4b68-a320-4fab18920606">
<ul class="org-ul">
<li>Use sunscreen when you will be outside for extended periods of time (&gt;30 min)</li>
<li>Moisturize chronic or seasonally dry areas</li>
<li>WASH YO FACE</li>
</ul>
</div>
</div>

<div id="outline-container-h-23ddb084-820d-4469-99c3-cefa2a646056" class="outline-2">
<h2 id="h-23ddb084-820d-4469-99c3-cefa2a646056"><span class="section-number-2">6.</span> Lungs <span class=anchor><a href="#h-23ddb084-820d-4469-99c3-cefa2a646056">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-23ddb084-820d-4469-99c3-cefa2a646056">
<p>
Your lungs are only meant to process air. Don&rsquo;t make a habit of putting not-air into them.
</p>
</div>
</div>

<div id="outline-container-h-663e81a9-8ea1-4b2d-93c2-326ddfcb02ac" class="outline-2">
<h2 id="h-663e81a9-8ea1-4b2d-93c2-326ddfcb02ac"><span class="section-number-2">7.</span> Brain <span class=anchor><a href="#h-663e81a9-8ea1-4b2d-93c2-326ddfcb02ac">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-663e81a9-8ea1-4b2d-93c2-326ddfcb02ac">
<p>
Philosophy can be kind of weirdly helpful because changing your view can make &ldquo;everything&rdquo; seem totally different even though nothing has changed. I find the concepts in the school of stoicism motivating and helpful for becoming content (ie not happy).
</p>
</div>
</div>

<div id="outline-container-h-b5506c20-0216-43e2-a03e-8bac63e4d748" class="outline-2">
<h2 id="h-b5506c20-0216-43e2-a03e-8bac63e4d748"><span class="section-number-2">8.</span> Supplements <span class=anchor><a href="#h-b5506c20-0216-43e2-a03e-8bac63e4d748">⚓</a></span></h2>
<div class="outline-text-2" id="text-h-b5506c20-0216-43e2-a03e-8bac63e4d748">
<p>
This section is less &ldquo;tried and true&rdquo; maintenance &#x2013; that is, sleep + exercise will do much more for you than anything in this section.
</p>

<p>
Some supplements may be thought of as insurance &#x2013; the idea is you are somehow more deficient than you &ldquo;normally&rdquo; would be, so you should compensate your bodily need externally to cheat the natural route. I will tag those supplement headings with an <code>insurance</code> tag.
</p>
</div>

<div id="outline-container-h-345ced5c-c5df-4c31-8cb3-a1ae8f49f0b5" class="outline-3">
<h3 id="h-345ced5c-c5df-4c31-8cb3-a1ae8f49f0b5"><span class="section-number-3">8.1.</span> Magnesium <span class=anchor><a href="#h-345ced5c-c5df-4c31-8cb3-a1ae8f49f0b5">⚓</a></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="insurance">insurance</span></span></h3>
<div class="outline-text-3" id="text-h-345ced5c-c5df-4c31-8cb3-a1ae8f49f0b5">
<p>
<a href="https://examine.com/supplements/Magnesium/#effect-matrix">examine.com: Magnesium</a>
</p>
</div>
</div>


<div id="outline-container-h-3ff5ebe0-cb48-4961-961f-dde558b47d1e" class="outline-3">
<h3 id="h-3ff5ebe0-cb48-4961-961f-dde558b47d1e"><span class="section-number-3">8.2.</span> D3 <span class=anchor><a href="#h-3ff5ebe0-cb48-4961-961f-dde558b47d1e">⚓</a></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="insurance">insurance</span></span></h3>
<div class="outline-text-3" id="text-h-3ff5ebe0-cb48-4961-961f-dde558b47d1e">
<p>
<a href="https://examine.com/supplements/vitamin-d/#effect-matrix">examine.com: vitamin-d</a>
</p>
</div>
</div>

<div id="outline-container-h-7bff7ed1-2f56-4142-88e7-2651d3c1e2d4" class="outline-3">
<h3 id="h-7bff7ed1-2f56-4142-88e7-2651d3c1e2d4"><span class="section-number-3">8.3.</span> Fish Oil <span class=anchor><a href="#h-7bff7ed1-2f56-4142-88e7-2651d3c1e2d4">⚓</a></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="insurance">insurance</span></span></h3>
<div class="outline-text-3" id="text-h-7bff7ed1-2f56-4142-88e7-2651d3c1e2d4">
<p>
<a href="https://examine.com/supplements/fish-oil/#effect-matrix">examine.com: fish-oil</a>
</p>
</div>
</div>

<div id="outline-container-h-9cf0cab2-ede6-4d27-afb0-b89587946b92" class="outline-3">
<h3 id="h-9cf0cab2-ede6-4d27-afb0-b89587946b92"><span class="section-number-3">8.4.</span> Creatine <span class=anchor><a href="#h-9cf0cab2-ede6-4d27-afb0-b89587946b92">⚓</a></span></h3>
<div class="outline-text-3" id="text-h-9cf0cab2-ede6-4d27-afb0-b89587946b92">
<p>
<a href="https://examine.com/supplements/creatine/#effect-matrix">examine.com: creatine</a>
</p>
</div>
</div>

<div id="outline-container-h-1e8c3f51-c8ee-41da-bbf8-6b530d32238a" class="outline-3">
<h3 id="h-1e8c3f51-c8ee-41da-bbf8-6b530d32238a"><span class="section-number-3">8.5.</span> Ashwagandha <span class=anchor><a href="#h-1e8c3f51-c8ee-41da-bbf8-6b530d32238a">⚓</a></span></h3>
<div class="outline-text-3" id="text-h-1e8c3f51-c8ee-41da-bbf8-6b530d32238a">
<p>
<a href="https://examine.com/supplements/Ashwagandha/#effect-matrix">examine.com: Ashwagandha</a>
</p>
</div>
</div>

<div id="outline-container-h-b27c5cef-b862-4889-afe0-b5ab892cdf6a" class="outline-3">
<h3 id="h-b27c5cef-b862-4889-afe0-b5ab892cdf6a"><span class="section-number-3">8.6.</span> Rhodiola rosea <span class=anchor><a href="#h-b27c5cef-b862-4889-afe0-b5ab892cdf6a">⚓</a></span></h3>
<div class="outline-text-3" id="text-h-b27c5cef-b862-4889-afe0-b5ab892cdf6a">
<p>
<a href="https://examine.com/supplements/rhodiola-rosea/#effect-matrix">examine.com: rhodiola-rosea</a>
</p>


<p>
<div class='flair'></div>
</p>

<div class='footer-left'>
    <a href='/index.html'>arst wow</a>
</div>

<p>
<div class=footer-center>type: post</div>
</p>

<div class="footer-right">
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2020-07-15-meatbag-maintenance.org">Page Markup</a>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
